/********************************************************************************
** 文件名：ADC.C		//@11.0592MHz
** 功能：AD转换
** 说明：P1为模拟输入口，CHX为读取端口，每次只能读取一个。
** 修改日期：2017-06-29
** 作者：c.c. 
*********************************************************************************/
#include"ADC.H"
//uchar ADC_Write_byte,ADC_Read_byte;


/****************************************************************
/*函数：void ADC_init(uchar CHX)		
/*功能：初始化AD配置寄存器
/*说明：
/*参数：CHX需要AD的P1口具体通道，取值范围0x00-0xff
/*修改日期：2017-07-11
/*作者：C.C.
/***************************************************************/
void ADC_init(uchar CHX)
{
	ADC_RES  = 0;
//	ADC_RESL = 0;
	P1ASF &=0X00;
	P1ASF |= CHX;//选择通道切断内部反相器

//	CLK_DIV   |=0X20;
}


/****************************************************************
/*函数：uchar ADC_Read(uchar Write_byte)		
/*功能：AD
/*说明：
/*参数：Write_byte 取值0x00-0x07，
/*修改日期：2017-07-11
/*作者：C.C.
/***************************************************************/
uchar ADC_Read(uchar Write_byte)
{
	
	ADC_RES  = 0;				//配置寄存器储存地址
//	ADC_RESL = 0;
	ADC_CONTR &=0X00;
	ADC_CONTR = 0XE8|Write_byte;//打开电源，速度全速，FLAG清零,开始转换，或(|)通道，对应某个通道开始转换 
	while(1)
	{
	 	if(ADC_CONTR & 0X10)	//等待标志位FLAG 置一
		{
			ADC_CONTR = 0;		 
		 	return ADC_RES;		//返回存储地址的八位数据
		}	
	}	
}
/*******************************P1ASF***********************************
****B7		B6		B5		B4		|B3	  	 B2		 B1		 B0	  	****
****P17ASF	P16ASF	P15ASF	P14ASF	|P13ASF	 P12ASF	 P11ASF	 P10ASF	****
************************************************************************/


/*******************************ADC_CONTR*******************************
****B7		B6		B5		B4		|B3	  	 B2		 B1		 B0	  	****
****POWER	SPEED1	SPEED2	FLAG	|START	 CHS2	 CHS1	 CHS0	****
************************************************************************/


/*******************************SCLK_DIV********************************
****B7		B6		B5		B4		|B3	  	 B2		 B1		 B0	  	****
****... 	... 	ADRJ 	... 	|...	 ... 	 ...	 ...	****
**************************结果存放****ADC_RES ADC_RESL******************
************************************************************************/