/*********************************************************************************
/*文件名：Key.C
/*功能：4*4按键
/*说明：
/*修改日期：2017-06-03
/*作者：c.c.
/*********************************************************************************/
#include"Delay.H"
#include"key.h"
#include "buzzer.h"
/*****************IO****************/
sbit s1 = P3^2;
sbit s2 = P5^2;
sbit s3 = P5^1;
sbit s4 = P5^0;
/***********************************/
unsigned char i=0,j=0,k=0,key;
unsigned char key_scan[]={0x7f,0xbf,0xdf,0xef};

//void Delay(uint i)
//{
// 	while(i--);
//}	
/****************************************************************
/*函数名：KEY16_scan()			
/*功能：按一下只读取一个键值，
/*说明：按键按下后，释放才返回键值。取值范围0~15
/*修改日期：2017-06-03
/*作者：c.c. 
/***************************************************************/
char KEY16_scan()
{
	uchar kcount=100;
	for(i=0;i<4;i++)
	{
		P7 = key_scan[i];
		if(P7!=key_scan[i])
		{
			Delay(5000);
			if(P7!=key_scan[i])
			{
		 		k = P7;
				for(j=0;j<4;j++)
				{
				 	if(!(k & 0x01))
					{
						while(1)	 	//用户放键再发送键值
						{
							if(P7==key_scan[i])
							{
								Delay(100);//10ms	消抖
								if(P7==key_scan[i])
								{
//									Buzzer(0);
									return (j*4+i);
								}
							}
						}
					}
					k>>=1;
				}
			}
		}		
	}
	return -1;
}

/****************************************************************
/*函数名：KEY16_Flag()			
/*功能：按键标志
/*说明：1表示按键按下
/*修改日期：2017-06-03
/*作者：c.c. 
/***************************************************************/

uchar KEY16_Flag()
{
	for(i=0;i<4;i++)
	{
		P7 = key_scan[i];
		if(P7!=key_scan[i])
		{
			return 1;
		}
	}
	return 0;
}

/****************************************************************
/*函数名：KEY4_scan()			
/*功能：按一下只读取一个键值，
/*说明：按键按下后，释放才返回键值。取值范围0~3
/*修改日期：2017-11-04
/*作者：c.c. 
/***************************************************************/
uchar KEY4_scan()
{
 	if(s1==0)	
	{
		Delay(90);
		if(s1==0)
		{
//			Buzzer(0);
			return 1;
		}			
	}

	if(s2==0)	
	{
		Delay(90);
		if(s2==0)
		{
//		 	Buzzer(0);
			return 2;
		}
	}

	if(s3==0)	
	{
		Delay(90);
		if(s3==0)
		{
//		 	Buzzer(0);
			return 3;
		}		
	}

	if(s4==0)	
	{
		Delay(90);
		if(s4==0)
		{
//			Buzzer(0);
			return 4;
		}	
	}
	return 0;                                                                                                                                                                                                                                                                                                         
}











