#include "PWM.H"
#include "PID.H"
#include"system.h"

/********************************************************************************
** 函数名：void PWM_init()
** 功能： 
** 说明：	 CYCLE 1-32767
** 修改日期：2017-11-12
** 作者：c.c. 
*********************************************************************************/
void PWM_init()
{
	P_SW2  |= EAXSFR;//访问拓展寄存器使能
	PWMCFG &= 0X00;//全部初始状态为0，不触发ADC转换
	PWMIF &= 0x00;//中断清空

	PWMCKS |= 0;//PWM时钟为系统时钟/（11+1）

//	PWM2CR |= EPWM2I;//默认使用引脚P37,打开中断
//	PWM2CR |= EC2T2SI;//,T2翻转中断

	PWMC = CYCLE;
	PWM2T1 = 0;
	PWM2T2 = 5;

	PWMCR &= 0x00;//
//	PWMCR |= ECBI;//打开中断
	EA = 1;
	PWMCR |= ENC20;//PWM2输出使能
	PWMCR |= ENPWM;//开始计数
	
	P_SW2 |= ~EAXSFR;//关闭拓展寄存器使能
}

/********************************************************************************
** 函数名：void PWM2_set()
** 功能： 
** 说明：
** 修改日期：2017-11-12
** 作者：c.c. 
*********************************************************************************/
void PWM2_set(uint duty)			 //bug:加上中断出现雪花屏，pwm正常
{
	P_SW2  |= EAXSFR;//访问拓展寄存器使能
//	PWM2T1 = 0;
	PWM2T2 = duty;
	P_SW2  |= ~EAXSFR;//关闭拓展寄存器使能
}

void PWM2_Interrupt() interrupt 22
{
	if(PWMIF&&C2IF)
	{
	 	PWMIF &= ~C2IF;//中断清零，和C2IF

		PWM2_set(500);
	}
	P2 = ~P2;
}
